# n = input("Введите трехзначное число: ")
# b = 0
# for i in n :
#     a = int(i)
#     b = a + b

# print(b)

# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# cranes = int(input("Введите сколько сделано журавликов: "))

# petr = int(cranes/6)

# sergey = petr

# cate = (petr + sergey)*2

# print(f'Petr - {petr} , Sergey - {sergey} , Cate - {cate}')
